#pragma once
#include "opencv2/opencv.hpp"
using namespace cv;


const int imageWidth = 640; // 摄像头的分辨率
const int imageHeight = 480;
Size imageSize = Size(imageWidth, imageHeight);

Rect validROIL; // 图像校正之后，会对图像进行裁剪，这里的validROI就是指裁剪之后的区域
Rect validROIR;

Mat mapLx, mapLy, mapRx, mapRy; // 映射表
Mat Rl, Rr, Pl, Pr, Q;          // 校正旋转矩阵R，投影矩阵P 重投影矩阵Q
Mat xyz;                        // 三维坐标

Point origin;              // 鼠标按下的起始点
Rect selection;            // 定义矩形选框
bool selectObject = false; // 是否选择对象
Vec3f point3;
float d;


/*事先标定好的左相机的内参矩阵
fx 0 cx
0 fy cy
0  0  1
*/
Mat cameraMatrixL = (Mat_<double>(3, 3) << 516.5066236, -1.444673028, 320.2950423, 0, 516.5816117, 270.7881873, 0, 0, 1.);
// 获得的畸变参数

/*418.523322187048	0	0
-1.26842201390676	421.222568242056	0
344.758267538961	243.318992284899	1 */
// 2

Mat distCoeffL = (Mat_<double>(5, 1) << -0.046645194, 0.077595167, 0.012476819, -0.000711358, 0);
//[0.006636837611004,0.050240447649195] [0.006681263320267,0.003130367429418]

/*事先标定好的右相机的内参矩阵
fx 0 cx
0 fy cy
0  0  1
*/
Mat cameraMatrixR = (Mat_<double>(3, 3) << 511.8428182, 1.295112628, 317.310253, 0, 513.0748795, 269.5885026, 0, 0, 1);

/*
417.417985082506	0	0
0.498638151824367	419.795432389420	0
309.903372309072	236.256106972796	1
*/
// 2

Mat distCoeffR = (Mat_<double>(5, 1) << -0.061588946, 0.122384376, 0.011081232, -0.000750439, 0);
//[-0.038407383078874,0.236392800301615]  [0.004121779274885,0.002296129959664]

Mat T = (Mat_<double>(3, 1) << -120.3559901, -0.188953775, -0.662073075); // T平移向量
//[-1.210187345641146e+02,0.519235426836325,-0.425535566316217]
// 对应Matlab所得T参数
// Mat rec = (Mat_<double>(3, 1) << -0.00306, -0.03207, 0.00206);//rec旋转向量，对应matlab om参数  我
Mat rec = (Mat_<double>(3, 3) << 0.999911333, -0.004351508, 0.012585312,
    0.004184066, 0.999902792, 0.013300386,
    -0.012641965, -0.013246549, 0.999832341); // rec旋转向量，对应matlab om参数  我

/* 0.999341122700880	0.000660748031451783	-0.0362888948713456
-0.00206388651740061	0.999250989651683	-0.0386419468010579
0.0362361815232777	0.0386913826603732	0.998593969567432 */

// Mat T = (Mat_<double>(3, 1) << -48.4, 0.241, -0.0344);//T平移向量
//[-1.210187345641146e+02,0.519235426836325,-0.425535566316217]
// 对应Matlab所得T参数

Mat R; // R 旋转矩阵